In [25]:
import pandas as pd
import requests
from io import StringIO

In [26]:
import requests
import pandas as pd
from io import StringIO

# The URL of the raw CSV file
url = 'https://raw.githubusercontent.com/campusx-official/100-days-of-machine-learning/main/day15%20-%20working%20with%20csv%20files/aug_train.csv'

# Download the file content
response = requests.get(url)

# Check if the download was successful

    # Read the CSV data into a pandas DataFrame
df = pd.read_csv(StringIO(response.text),index_col=False) 
df

,enrollee_id,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours,target
0,8949,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,>20,NaN,NaN,1,36,1.0
1,29725,city_40,0.776,Male,No relevent experience,no_enrollment,Graduate,STEM,15,50-99,Pvt Ltd,>4,47,0.0
2,11561,city_21,0.624,NaN,No relevent experience,Full time course,Graduate,STEM,5,NaN,NaN,never,83,0.0
3,33241,city_115,0.789,NaN,No relevent experience,NaN,Graduate,Business Degree,<1,NaN,Pvt Ltd,never,52,1.0
4,666,city_162,0.767,Male,Has relevent experience,no_enrollment,Masters,STEM,>20,50-99,Funded Startup,4,8,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
19153,7386,city_173,0.878,Male,No relevent experience,no_enrollment,Graduate,Humanities,14,NaN,NaN,1,42,1.0
19154,31398,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,14,NaN,NaN,4,52,1.0
19155,24576,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,>20,50-99,Pvt Ltd,4,44,0.0
19156,5756,city_65,0.802,Male,Has relevent experience,no_enrollment,High School,NaN,<1,500-999,Pvt Ltd,2,97,0.0
19157,23834,city_67,0.855,NaN,No relevent experience,no_enrollment,Primary School,NaN,2,NaN,NaN,1,127,0.0

sep parameter
Description: Specifies the delimiter used in the CSV file (default: ,).

In [27]:
# sep parameter

In [28]:

# index_col perameter ( you can set the index by index_col parameter)
df =pd.read_csv('datasets/aug_train.csv',index_col='enrollee_id')

In [29]:
# header parameter
pd.read_csv('datasets/test.csv',header=1)

,0,enrollee_id,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours,target
0,1,29725,city_40,0.776,Male,No relevent experience,no_enrollment,Graduate,STEM,15,50-99,Pvt Ltd,>4,47,0
1,2,11561,city_21,0.624,NaN,No relevent experience,Full time course,Graduate,STEM,5,NaN,NaN,never,83,0
2,3,33241,city_115,0.789,NaN,No relevent experience,NaN,Graduate,Business Degree,<1,NaN,Pvt Ltd,never,52,1
3,4,666,city_162,0.767,Male,Has relevent experience,no_enrollment,Masters,STEM,>20,50-99,Funded Startup,4,8,0

In [30]:
# usecols parameter  ( filter the selective columns you want )
pd.read_csv('datasets/aug_train.csv',usecols=['enrollee_id','gender','education_level'])

       enrollee_id gender education_level
0             8949   Male        Graduate
1            29725   Male        Graduate
2            11561    NaN        Graduate
3            33241    NaN        Graduate
4              666   Male         Masters
...            ...    ...             ...
19153         7386   Male        Graduate
19154        31398   Male        Graduate
19155        24576   Male        Graduate
19156         5756   Male     High School
19157        23834    NaN  Primary School

[19158 rows x 3 columns]

In [31]:
#  skiprows and nrows (skiprows skip the rows gven in the output) and (nrows generate the no of rows you want to generate)
pd.read_csv('datasets/aug_train.csv',skiprows=[0,1])
pd.read_csv('datasets/aug_train.csv',nrows=150)

,enrollee_id,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours,target
0,8949,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,>20,NaN,NaN,1,36,1.0
1,29725,city_40,0.776,Male,No relevent experience,no_enrollment,Graduate,STEM,15,50-99,Pvt Ltd,>4,47,0.0
2,11561,city_21,0.624,NaN,No relevent experience,Full time course,Graduate,STEM,5,NaN,NaN,never,83,0.0
3,33241,city_115,0.789,NaN,No relevent experience,NaN,Graduate,Business Degree,<1,NaN,Pvt Ltd,never,52,1.0
4,666,city_162,0.767,Male,Has relevent experience,no_enrollment,Masters,STEM,>20,50-99,Funded Startup,4,8,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
145,7777,city_114,0.926,NaN,Has relevent experience,no_enrollment,Masters,STEM,>20,NaN,NaN,never,120,0.0
146,22718,city_157,0.769,NaN,Has relevent experience,no_enrollment,Graduate,No Major,14,10000+,NaN,>4,47,0.0
147,1261,city_73,0.754,Male,Has relevent experience,no_enrollment,Graduate,STEM,12,NaN,NaN,2,100,1.0
148,3396,city_67,0.855,Male,Has relevent experience,Part time course,Graduate,STEM,6,500-999,Pvt Ltd,never,102,0.0
149,4283,city_103,0.920,Male,No relevent experience,no_enrollment,High School,NaN,4,NaN,NaN,never,52,0.0

In [32]:
# encoding
pd.read_csv('datasets/zomato.csv',encoding='latin-1')

,Restaurant ID,Restaurant Name,Country Code,City,Address,Locality,Locality Verbose,Longitude,Latitude,Cuisines,...,Currency,Has Table booking,Has Online delivery,Is delivering now,Switch to order menu,Price range,Aggregate rating,Rating color,Rating text,Votes
0,6317637,Le Petit Souffle,162,Makati City,"Third Floor, Century City Mall, Kalayaan Avenu...","Century City Mall, Poblacion, Makati City","Century City Mall, Poblacion, Makati City, Mak...",121.027535,14.565443,"French, Japanese, Desserts",...,Botswana Pula(P),Yes,No,No,No,3,4.8,Dark Green,Excellent,314
1,6304287,Izakaya Kikufuji,162,Makati City,"Little Tokyo, 2277 Chino Roces Avenue, Legaspi...","Little Tokyo, Legaspi Village, Makati City","Little Tokyo, Legaspi Village, Makati City, Ma...",121.014101,14.553708,Japanese,...,Botswana Pula(P),Yes,No,No,No,3,4.5,Dark Green,Excellent,591
2,6300002,Heat - Edsa Shangri-La,162,Mandaluyong City,"Edsa Shangri-La, 1 Garden Way, Ortigas, Mandal...","Edsa Shangri-La, Ortigas, Mandaluyong City","Edsa Shangri-La, Ortigas, Mandaluyong City, Ma...",121.056831,14.581404,"Seafood, Asian, Filipino, Indian",...,Botswana Pula(P),Yes,No,No,No,4,4.4,Green,Very Good,270
3,6318506,Ooma,162,Mandaluyong City,"Third Floor, Mega Fashion Hall, SM Megamall, O...","SM Megamall, Ortigas, Mandaluyong City","SM Megamall, Ortigas, Mandaluyong City, Mandal...",121.056475,14.585318,"Japanese, Sushi",...,Botswana Pula(P),No,No,No,No,4,4.9,Dark Green,Excellent,365
4,6314302,Sambo Kojin,162,Mandaluyong City,"Third Floor, Mega Atrium, SM Megamall, Ortigas...","SM Megamall, Ortigas, Mandaluyong City","SM Megamall, Ortigas, Mandaluyong City, Mandal...",121.057508,14.584450,"Japanese, Korean",...,Botswana Pula(P),Yes,No,No,No,4,4.8,Dark Green,Excellent,229
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
9546,5915730,NamlÛ± Gurme,208,ÛÁstanbul,"Kemankeô Karamustafa Paôa Mahallesi, RÛ±htÛ±...",Karakí_y,"Karakí_y, ÛÁstanbul",28.977392,41.022793,Turkish,...,Turkish Lira(TL),No,No,No,No,3,4.1,Green,Very Good,788
9547,5908749,Ceviz AÛôacÛ±,208,ÛÁstanbul,"Koôuyolu Mahallesi, Muhittin íìstí_ndaÛô Cadd...",Koôuyolu,"Koôuyolu, ÛÁstanbul",29.041297,41.009847,"World Cuisine, Patisserie, Cafe",...,Turkish Lira(TL),No,No,No,No,3,4.2,Green,Very Good,1034
9548,5915807,Huqqa,208,ÛÁstanbul,"Kuruí_eôme Mahallesi, Muallim Naci Caddesi, N...",Kuruí_eôme,"Kuruí_eôme, ÛÁstanbul",29.034640,41.055817,"Italian, World Cuisine",...,Turkish Lira(TL),No,No,No,No,4,3.7,Yellow,Good,661
9549,5916112,Aôôk Kahve,208,ÛÁstanbul,"Kuruí_eôme Mahallesi, Muallim Naci Caddesi, N...",Kuruí_eôme,"Kuruí_eôme, ÛÁstanbul",29.036019,41.057979,Restaurant Cafe,...,Turkish Lira(TL),No,No,No,No,4,4.0,Green,Very Good,901
9550,5927402,Walter's Coffee Roastery,208,ÛÁstanbul,"CafeaÛôa Mahallesi, BademaltÛ± Sokak, No 21/B,...",Moda,"Moda, ÛÁstanbul",29.026016,40.984776,Cafe,...,Turkish Lira(TL),No,No,No,No,2,4.0,Green,Very Good,591

In [33]:
# convertors
#na_values
# chunke size
# parse_date

In [ ]:
import requests
import pandas as pd
from io import StringIO

# Use the raw CSV file URL from GitHub
url = "https://raw.githubusercontent.com/campusx-official/100-days-of-machine-learning/main/day15%20-%20working%20with%20csv%20files/IPL%20Matches%202008-2020.csv"
response = requests.get(url)


df = pd.read_csv(StringIO(response.text)).reset_index()
df.head()

,index,id,city,date,player_of_match,venue,neutral_venue,team1,team2,toss_winner,toss_decision,winner,result,result_margin,eliminator,method,umpire1,umpire2
0,0,335982,Bangalore,2008-04-18,BB McCullum,M Chinnaswamy Stadium,0,Royal Challengers Bangalore,Kolkata Knight Riders,Royal Challengers Bangalore,field,Kolkata Knight Riders,runs,140.0,N,NaN,Asad Rauf,RE Koertzen
1,1,335983,Chandigarh,2008-04-19,MEK Hussey,"Punjab Cricket Association Stadium, Mohali",0,Kings XI Punjab,Chennai Super Kings,Chennai Super Kings,bat,Chennai Super Kings,runs,33.0,N,NaN,MR Benson,SL Shastri
2,2,335984,Delhi,2008-04-19,MF Maharoof,Feroz Shah Kotla,0,Delhi Daredevils,Rajasthan Royals,Rajasthan Royals,bat,Delhi Daredevils,wickets,9.0,N,NaN,Aleem Dar,GA Pratapkumar
3,3,335985,Mumbai,2008-04-20,MV Boucher,Wankhede Stadium,0,Mumbai Indians,Royal Challengers Bangalore,Mumbai Indians,bat,Royal Challengers Bangalore,wickets,5.0,N,NaN,SJ Davis,DJ Harper
4,4,335986,Kolkata,2008-04-20,DJ Hussey,Eden Gardens,0,Kolkata Knight Riders,Deccan Chargers,Deccan Chargers,bat,Kolkata Knight Riders,wickets,5.0,N,NaN,BF Bowden,K Hariharan
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
811,811,1216547,Dubai,2020-09-28,AB de Villiers,Dubai International Cricket Stadium,0,Royal Challengers Bangalore,Mumbai Indians,Mumbai Indians,field,Royal Challengers Bangalore,tie,NaN,Y,NaN,Nitin Menon,PR Reiffel
812,812,1237177,Dubai,2020-11-05,JJ Bumrah,Dubai International Cricket Stadium,0,Mumbai Indians,Delhi Capitals,Delhi Capitals,field,Mumbai Indians,runs,57.0,N,NaN,CB Gaffaney,Nitin Menon
813,813,1237178,Abu Dhabi,2020-11-06,KS Williamson,Sheikh Zayed Stadium,0,Royal Challengers Bangalore,Sunrisers Hyderabad,Sunrisers Hyderabad,field,Sunrisers Hyderabad,wickets,6.0,N,NaN,PR Reiffel,S Ravi
814,814,1237180,Abu Dhabi,2020-11-08,MP Stoinis,Sheikh Zayed Stadium,0,Delhi Capitals,Sunrisers Hyderabad,Delhi Capitals,bat,Delhi Capitals,runs,17.0,N,NaN,PR Reiffel,S Ravi
815,815,1237181,Dubai,2020-11-10,TA Boult,Dubai International Cricket Stadium,0,Delhi Capitals,Mumbai Indians,Delhi Capitals,bat,Mumbai Indians,wickets,5.0,N,NaN,CB Gaffaney,Nitin Menon

sheet_name: Specify the sheet to read (default is the first sheet).
If the Excel file has multiple sheets, you can specify the sheet by name or index (e.g., 0 for the first sheet).
If the file is not in the same directory, provide the full file path.

3. Export the DataFrame to an Excel File
Use pandas.DataFrame.to_excel() to save the DataFrame to an Excel file.

In [ ]:
# Export DataFrame to Excel
df.to_excel('output_file.xlsx', sheet_name='Processed_Data', index=False)

index=False: Excludes the DataFrame index from the Excel file (optional, include if you want the index).
sheet_name: Specifies the name of the sheet in the output Excel file.
If the file already exists, it will be overwritten unless you use an ExcelWriter (see below for multiple sheets).

1. Read a Text File into a DataFrame
Text files often come in formats like CSV, tab-separated (TSV), or space-separated values. You can use pandas.read_csv() or pandas.read_table() to load them into a DataFrame. The method depends on the file’s structure (e.g., delimiter-separated or fixed-width).

In [ ]:
import pandas as pd

# Step 1: Read the tab-separated text file into a DataFrame
df = pd.read_csv('datasets/employees.txt', sep='\t')

# Step 2: Apply a filter (e.g., employees with Salary > 80,000)
filtered_df = df[['ID','Name','Age','Department','Salary']]

# Step 3: Export the filtered DataFrame to a CSV file
filtered_df.to_csv('filtered_employees.csv', index=False)

print("Filtered dataset exported to 'filtered_employees.csv'")

In [ ]:

# convert csv file to excel
temp_df=pd.read_csv('datasets/aug_train.csv')
temp_df.to_excel('myfile.xlsx',sheet_name="TrainData",index=False)

In [ ]:
# convert excel to csv
temp_df =pd.read_excel('myfile.xlsx')[['enrollee_id','city','gender']]
temp_df.to_csv('Trn.csv',index=False)

Steps to Work with JSON Files in a DataFrame
1. Read a JSON File into a DataFrame
Use pandas.read_json() to load a JSON file into a DataFrame. The JSON file’s structure (e.g., array of objects, nested JSON) determines how it’s converted to a DataFrame.

In [ ]:
# csv to json
temp_df=pd.read_csv('datasets/IPL Matches 2008-2020.csv')[['id','city','date','player_of_match','venue']]
temp_df.to_json('cricket.json',index=False)

In [ ]:
# json to html
pd.read_json('cricket.json').to_html('cric.html',index=False)

In [ ]:
import requests
import pandas as pd
url = 'https://api.themoviedb.org/3/tv/top_rated?language=en-US&page=1&api_key=203ce05490a14bd7d440d44d4758ec01'
response=requests.get(url)
temp_df=pd.DataFrame(response.json()['results'])[['id','origin_country','original_name','popularity','name','vote_average']]
temp_df.head()

,id,origin_country,original_name,popularity,name,vote_average
0,1396,[US],Breaking Bad,158.7039,Breaking Bad,8.926
1,209867,[JP],葬送のフリーレン,62.9987,Frieren: Beyond Journey's End,8.800
2,94605,[US],Arcane,68.9651,Arcane,8.764
3,246,[US],Avatar: The Last Airbender,38.8272,Avatar: The Last Airbender,8.752
4,219246,[KR],폭싹 속았수다,57.9774,When Life Gives You Tangerines,8.700
5,131378,[US],Adventure Time: Fionna & Cake,39.6196,Adventure Time: Fionna & Cake,8.724
6,37854,[JP],ワンピース,141.3300,One Piece,8.700
7,31911,[JP],鋼の錬金術師 FULLMETAL ALCHEMIST,37.6405,Fullmetal Alchemist: Brotherhood,8.700
8,60059,[US],Better Call Saul,105.6273,Better Call Saul,8.696
9,94954,[US],Hazbin Hotel,44.8835,Hazbin Hotel,8.691
10,87108,[US],Chernobyl,47.2802,Chernobyl,8.690
11,60625,[US],Rick and Morty,252.0580,Rick and Morty,8.689
12,220542,[JP],薬屋のひとりごと,125.7614,The Apothecary Diaries,8.700
13,1429,[JP],進撃の巨人,47.1927,Attack on Titan,8.700
14,92685,[US],The Owl House,45.9482,The Owl House,8.666
15,46298,[JP],HUNTER×HUNTER,226.3100,Hunter x Hunter,8.700
16,85077,[US],The Chosen,74.0647,The Chosen,8.662
17,70785,[CA],Anne with an E,40.8133,Anne with an E,8.660
18,1398,[US],The Sopranos,164.3570,The Sopranos,8.656
19,42705,[JP],はじめの一歩,26.5040,Fighting Spirit,8.655

In [ ]:
df = pd.DataFrame()
for i in range(1,113):
    url = 'https://api.themoviedb.org/3/tv/top_rated?language=en-US&page={}&api_key=203ce05490a14bd7d440d44d4758ec01'.format(i)
    response=requests.get(url)
    temp_df=pd.DataFrame(response.json()['results'])[['id','origin_country','original_name','popularity','name','vote_average']]
    df=pd.concat([df, temp_df], ignore_index=True)
    
df.head()

,id,origin_country,original_name,popularity,name,vote_average
0,1396,[US],Breaking Bad,158.7039,Breaking Bad,8.926
1,209867,[JP],葬送のフリーレン,62.9987,Frieren: Beyond Journey's End,8.800
2,94605,[US],Arcane,68.9651,Arcane,8.764
3,246,[US],Avatar: The Last Airbender,38.8272,Avatar: The Last Airbender,8.752
4,219246,[KR],폭싹 속았수다,57.9774,When Life Gives You Tangerines,8.700
...,...,...,...,...,...,...
2224,135251,[US],The Idol,21.9929,The Idol,5.412
2225,10160,[US],Big Brother,55.5107,Big Brother,5.100
2226,130392,[US],The D'Amelio Show,14.2566,The D'Amelio Show,5.000
2227,1871,[GB],EastEnders,299.2197,EastEnders,4.146
2228,126725,[US],Velma,17.4883,Velma,3.412

In [ ]:
# conver to csv file
df.to_csv('movies.csv')